fish_data = {
    "문치가자미": {
        "학명": "Pleuronectes yokohamae",
        "금지체장": "20cm 이하"
        },
        "금어기": "12.1~익년 1.31"
    },
    "감성돔": {
        "학명": "Acanthopagrus schlegelii",
        "금지체장": "25cm 이하",
        "금어기": "5.1~5.31"
    },
    "돌돔": {
        "학명": "Oplegnathus fasciatus",
        "금지체장": "24cm 이하"
    },
    "참돔": {
        "학명": "Pagrus major",
        "금지체장": "24cm 이하"
    },
    "넙치": {
        "학명": "Paralichthys olivaceus",
        "금지체장": "35cm 이하"
    },
    "농어": {
        "학명": "Lateolabrax japonicus",
        "금지체장": "30cm 이하"
    },
    "대구": {
        "학명": "Gadus macrocephalus",
        "금지체장": "35cm 이하",
        "금어기": "1.16~2.15"
    },
    "도루묵": {
        "학명": "Arctoscopus japonicus",
        "금지체장": "11cm 이하"
    },
    "민어": {
        "학명": "Miichthys miiuy",
        "금지체장": "33cm 이하"
    },
    "방어": {
        "학명": "Seriola quinqueradiata",
        "금지체장": "30cm 이하"
    },
    "볼락": {
        "학명": "Sebastes inermis",
        "금지체장": "15cm 이하"
    },
    "붕장어": {
        "학명": "Conger myriaster",
        "금지체장": "35cm 이하"
    },
    "조피볼락": {
        "학명": "Sebastes schlegelii",
        "금지체장": "23cm 이하"
    },
    "쥐노래미": {
        "학명": "Hexagrammos otakii",
        "금지체장": "20cm 이하",
        "금어기": "11.1~12.31",
        "금어기_해역_특이사항": "특정 해역은 11.15~12.14"
    },
    "참홍어": {
        "학명": "Raja pulchra",
        "금지체장": "체반폭 42cm 이하",
        "금어기": "6.1~7.15"
    },
    "갈치": {
        "학명": "Trichiurus lepturus",
        "금지체장": "항문장 18cm 이하",
        "금어기": "7.1~7.31",
        "금어기_해역_특이사항": "북위 33도 이북 해역 한정, 근해채낚기어업 및 연안복합어업 제외",
        "포획비율제한": "어획량 중 10% 미만만 허용"
    },
    "고등어": {
        "학명": "Scomber japonicus",
        "금지체장": "21cm 이하",
        "금어기": "4.1~6.30 중 1개월 범위 내 고시",
        "포획비율제한": "어획량 중 10% 미만만 허용"
    },
    "참조기": {
        "학명": "Larimichthys polyactis",
        "금지체장": "15cm 이하",
        "금어기": "7.1~7.31",
        "유자망_금어기": "4.22~8.10",
        "포획비율제한": "어획량 중 10% 미만만 허용"
    },
    "말쥐치": {
        "학명": "Thamnaconus modestus",
        "금지체장": "18cm 이하",
        "금어기": "5.1~7.31",
        "금어기_예외": "정치망어업, 연안어업 및 구획어업은 6.1~7.31"
    },
    "갯장어": {
        "학명": "Muraenesox cinereus",
        "금지체장": "40cm 이하"
    },
    "미거지": {
        "학명": "Liparis ochotensis",
        "금지체장": "40cm 이하"
    },
    "청어": {
        "학명": "Clupea pallasii",
        "금지체장": "20cm 이하",
        "금어기": "10.1~11.30"
    },
    "꽃게": {
        "학명": "Portunus trituberculatus",
        "금지체장": "6.4cm 이하",
        "금어기": "6.1~9.30 중 2개월 이내",
        "포획비율제한": "어획량 중 5% 미만만 허용",
        "금어기_예외": "특정 어업 제외"
    },
    "대게": {
        "학명": "Chionoecetes opilio",
        "금지체장": "9cm 이하",
        "금어기": "6.1~11.30",
        "금어기_특정해역": "동경 131도30분 이동수역은 6.1~10.31",
        "금어기_추가": "동해 일부해역 3.1~4.30"
    },
    "붉은대게": {
        "학명": "Chionoecetes japonicus",
        "금어기": "7.10~8.25",
        "금어기_예외": "강원 연안자망 6.1~7.10"
    },
    "소라": {
        "학명": "Batillus cornutus",
        "금지체장": "각고 5cm 이하",
        "제주_금지체장": "각고 7cm 이하",
        "금어기": "6.1~6.30",
        "제주_금어기": "6.1~8.31",
        "제주_추자도_금어기": "7.1~8.31",
        "울릉_독도_금어기": "6.1~7.31"
    },
    "오분자기": {
        "학명": "Sulculus diversicolor diversicolor / aquatilis",
        "제주_금지체장": "각장 4cm 이하",
        "금어기": "7.1~8.31"
    },
    "전복류": {
        "학명": "Haliotis spp.",
        "금지체장": "각장 7cm 이하",
        "제주_금지체장": "각장 10cm 이하",
        "금어기": "9.1~10.31",
        "제주_금어기": "10.1~12.31"
    },
    "키조개": {
        "학명": "Atrina pectinata",
        "부산_울산_강원_경북_경남_금지체장": "18cm 이하",
        "금어기": "7.1~8.31"
    },
    "기수재첩": {
        "학명": "Corbicula japonica",
        "금지체장": "1.5cm 이하"
    },
    "넓미역": {
        "학명": "Undariopsis peterseniana",
        "금어기": "9.1~11.30",
        "제주_금어기": "5.1~11.30 중 3개월 이상 (시도별 별도 고시 가능)"
    },
    "우뭇가사리": {
        "학명": "Gelidium amansii",
        "금어기": "11.1~익년 3.31"
    },
    "톳": {
        "학명": "Hizikia fusiformis",
        "금어기": "10.1~익년 1.31"
    },
    "대문어": {
        "학명": "Octopus dofleini",
        "금지체중": "600g 이하"
    },
    "살오징어": {
        "학명": "Todarodes pacificus",
        "금지체장": "15cm 이하",
        "금어기": "4.1~5.31",
        "근해채낚기_연안복합_정치망_금어기": "4.1~4.30",
        "포획비율제한": "어획량 중 20% 미만만 허용"
    },
    "낙지": {
        "학명": "Octopus minor",
        "금어기": "6.1~6.30",
        "지역별_금어기": "4.1~9.30 중 1개월 이상"
    },
    "주꾸미": {
        "학명": "Amphioctopus fangsiao",
        "금어기": "5.11~8.31"
    },
    "참문어": {
        "학명": "Octopus vulgaris",
        "금어기": "5.16~6.30",
        "지역별_금어기": "5.1~9.15 중 46일 이상"
    },
    "해삼": {
        "학명": "Stichopus japonicus",
        "금어기": "7.1~7.31"
    }
}
